#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo_function.aws_iam_policy.function_role_policy will be created
  + resource "aws_iam_policy" "function_role_policy" {
      + arn         = (known after apply)
      + description = "lambda logging policy"
      + id          = (known after apply)
      + name        = "demo-function-role-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Name" = "demo-function-role-policy"
        }
      + tags_all    = {
          + "Name" = "demo-function-role-policy"
        }
    }

  # module.demo_function.aws_iam_role.function_role will be created
  + resource "aws_iam_role" "function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "demo-function function IAM role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-function-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "demo-function-role"
        }
      + tags_all              = {
          + "Name" = "demo-function-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.demo_function.aws_iam_role_policy_attachment.function_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-function-role"
    }

  # module.demo_function.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./files/lambda_function.zip"
      + function_name                  = "demo-function"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "DmR9tQSzczxm30yJoP0zAmrW42ULgYm3KR00XmPnYJc="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "demo-function"
        }
      + tags_all                       = {
          + "Name" = "demo-function"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.demo_function.aws_lambda_layer_version.function_layer[0] will be created
  + resource "aws_lambda_layer_version" "function_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + filename                    = "./files/lambda_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "demo-function-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "N17+65uq3QQq4A0ES04rJa1xY+f/iQwNcOGEOXYR6Js="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>
*Workflow: `[DP]Lambda`*